Locked-Inc/STAR/star-rx72n-firmware/libs/rx_usb/src/rx_usb_hw.c
#include <stddef.h>

#include "rx72n_regs.h"
#include "rx_log.h"
#include "rx_register_protection.h"
#include "rx_threadx_config.h"
#include "rx_time_constants.h"
#include "rx_usb.h"
#include "rx_usb_internal.h"
#include "tx_api.h"

/* =============================================================================
 * Private Definitions
 * =============================================================================
 */

static const char* s_tag = "USB_HW";

/** @brief USB timing constants for initialization delays */
typedef enum : uint16_t {
  k_usb_pll_stabilization_ms   = 10, /**< USB PLL stabilization time (10ms) */
  k_usb_clock_stabilization_ms = 10, /**< USB clock stabilization time (10ms) */
  k_min_sleep_ticks            = 1,  /**< Minimum sleep duration (1 tick) */
  k_min_transfer_size          = 0,  /**< Minimum data transfer size (no data) */
} usb_hw_timing_t;

/** @brief USB SYSCFG register values */
typedef enum : uint16_t {
  k_usb_syscfg_disabled = 0x0000, /**< USB module disabled (all bits clear) */
} usb_syscfg_value_t;

/** @brief FIFO operation timeouts and masks */
typedef enum : uint16_t {
  k_usb_fifo_timeout_iterations = 1000, /**< FIFO ready timeout (busy-wait iterations) */
  k_usb_fifo_timeout_expired    = 0,    /**< Timeout counter expired */
  k_usb_fifo_byte_mask          = 0xFF, /**< Byte mask for 8-bit FIFO read */
} usb_fifo_constants_t;

/** @brief USB address mask */
typedef enum : uint8_t {
  k_usb_address_mask_hw = 0x7F, /**< USB address mask (7 bits, 0-127) */
} usb_address_mask_t;

/** @brief Interrupt Controller (ICU) configuration constants */
typedef enum : uint8_t {
  k_icu_bits_per_ier_register = 8, /**< Number of interrupt enable bits per IER register */
  k_usb_interrupt_priority    = 6, /**< USB interrupt priority (moderate, below motor control) */
} usb_icu_config_t;

/** @brief USB pipe and endpoint validation limits */
typedef enum : uint16_t {
  k_usb_pipe_min            = 0,   /**< Minimum pipe number (DCP) */
  k_usb_pipe_max            = 9,   /**< Maximum pipe number */
  k_usb_endpoint_max        = 15,  /**< Maximum endpoint number (0-15) */
  k_usb_max_packet_size_max = 512, /**< Maximum packet size (512 bytes for FS) */
} usb_validation_limits_t;

/* =============================================================================
 * Private Variables
 * =============================================================================
 */

static bool s_hw_initialized = false;

/* =============================================================================
 * Public Functions
 * =============================================================================
 */

/**
 * @brief Initialize USB0 hardware
 *
 * This function:
 * 1. Enables the USB0 module clock (clears module stop bit)
 * 2. Configures USB0 for function (peripheral) mode
 * 3. Sets up the USB clock (48 MHz from PLL)
 * 4. Configures interrupts
 */
rx_err_t rx_usb_hw_init(void)
{
  if (s_hw_initialized) {
    return k_rx_ok;
  }

  rx_log_debug(s_tag, "Initializing USB0 hardware");

  /* 1. Enable USB0 module clock */
  /* Unlock protection */
  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;

  /* Clear module stop bit for USB0 (bit 19 in MSTPCRB) */
  system_regs()->mstpcrb &= ~(1UL << k_mstpb_usb0);

  /* Lock protection */
  *prcr_reg() = k_rx_prcr_lock;

  /* 2. Disable USB module before configuration */
  usb0()->syscfg = k_usb_syscfg_disabled;

  /* 3. Wait for USB PLL to stabilize */
  /* Note: USB requires 48 MHz clock from main PLL */
  uint32_t pll_ticks = k_usb_pll_stabilization_ms / k_threadx_ms_per_tick;
  if (pll_ticks == k_min_transfer_size) {
    pll_ticks = k_min_sleep_ticks;
  }
  tx_thread_sleep(pll_ticks);

  /* 4. Configure USB0 for Function (peripheral) mode */
  /* DCFM = 0: Function mode (not host) */
  /* DRPD = 0: Disable D+/D- pull-down (function mode) */
  /* DPRPU = 0: D+ pull-up disabled initially (enabled on attach) */
  /* USBE = 0: USB module disabled initially */
  usb0()->syscfg = k_usb_syscfg_disabled;

  /* 5. Configure USB clock */
  /* SCKE = 1: Enable USB clock */
  usb0()->syscfg |= k_usb_syscfg_scke;

  /* Wait for clock to stabilize */
  uint32_t clock_ticks = k_usb_clock_stabilization_ms / k_threadx_ms_per_tick;
  if (clock_ticks == k_min_transfer_size) {
    clock_ticks = k_min_sleep_ticks;
  }
  tx_thread_sleep(clock_ticks);

  /* 6. Enable USB module */
  usb0()->syscfg |= k_usb_syscfg_usbe;

  /* 7. Configure interrupts */
  /* Enable: VBUS, device state, control transfer, buffer ready/empty */
  usb0()->intenb0 = k_usb_intenb0_vbse | k_usb_intenb0_dvse | k_usb_intenb0_ctre |
                    k_usb_intenb0_brdye | k_usb_intenb0_bempe;

  /* 8. Configure Interrupt Controller (ICU) */
  /* Clear pending interrupt */
  icu()->ir[k_vect_usb0_usbi] = 0;

  /* Set interrupt priority */
  icu()->ipr[k_vect_usb0_usbi] = k_usb_interrupt_priority;

  /* Enable interrupt in IER */
  icu()->ier[k_vect_usb0_usbi / k_icu_bits_per_ier_register] |=
    (1 << (k_vect_usb0_usbi % k_icu_bits_per_ier_register));

  /* 9. Set default control pipe max packet size (64 bytes for FS) */
  usb0()->dcpmaxp = k_usb_cdc_max_packet_fs;

  s_hw_initialized = true;

  rx_log_info(s_tag, "USB0 hardware initialized");

  return k_rx_ok;
}

/**
 * @brief Deinitialize USB0 hardware
 */
rx_err_t rx_usb_hw_deinit(void)
{
  if (!s_hw_initialized) {
    return k_rx_ok;
  }

  rx_log_debug(s_tag, "Deinitializing USB0 hardware");

  /* Disable USB module */
  usb0()->syscfg = k_usb_syscfg_disabled;

  /* Disable interrupt in ICU */
  const uint8_t ier_bit  = (uint8_t)(k_vect_usb0_usbi % k_icu_bits_per_ier_register);
  const uint8_t ier_mask = (uint8_t)(1U << ier_bit);
  icu()->ier[k_vect_usb0_usbi / k_icu_bits_per_ier_register] &= (uint8_t)~ier_mask;
  icu()->ir[k_vect_usb0_usbi] = 0;

  /* Disable USB0 module clock */
  *prcr_reg() = k_rx_prcr_unlock_prc1_prc3;
  system_regs()->mstpcrb |= (1UL << k_mstpb_usb0);
  *prcr_reg() = k_rx_prcr_lock;

  s_hw_initialized = false;

  return k_rx_ok;
}

/**
 * @brief Attach to USB bus (enable D+ pull-up)
 *
 * This signals to the host that a device is connected.
 */
rx_err_t rx_usb_hw_attach(void)
{
  if (!s_hw_initialized) {
    return k_rx_err_invalid_state;
  }

  rx_log_debug(s_tag, "Attaching to USB bus");

  /* Enable D+ pull-up resistor to signal device presence */
  usb0()->syscfg |= k_usb_syscfg_dprpu;

