Locked-Inc/STAR/star-rx72n-firmware/libs/rx_usb/src/rx_usb_hw.c
  return k_rx_ok;
}

/**
 * @brief Detach from USB bus (disable D+ pull-up)
 */
rx_err_t rx_usb_hw_detach(void)
{
  if (!s_hw_initialized) {
    return k_rx_ok;
  }

  rx_log_debug(s_tag, "Detaching from USB bus");

  /* Disable D+ pull-up resistor */
  usb0()->syscfg &= (uint16_t)~k_usb_syscfg_dprpu;

  return k_rx_ok;
}

/**
 * @brief Read data from USB FIFO
 *
 * @param pipe Pipe number (0 = DCP, 1-9 = data pipes)
 * @param data Output buffer
 * @param max_len Maximum bytes to read
 * @return Number of bytes read
 */
uint32_t rx_usb_hw_fifo_read(uint8_t pipe, uint8_t* data, uint32_t max_len)
{
  /* Rule 5: Pre-condition validation */
  if (data == nullptr || max_len == k_min_transfer_size) {
    return k_min_transfer_size;
  }

  /* Validate pipe number */
  if (pipe > k_usb_pipe_max) {
    rx_log_error(s_tag, "Invalid pipe number");
    return k_min_transfer_size;
  }

  /* Select pipe for CFIFO access */
  usb0()->cfifosel = (pipe & k_usb_fifosel_curpipe_mask);

  /* Wait for FIFO ready (hardware polling) */
  /* NOTE: Busy-wait appropriate - microsecond-scale hardware readiness check */
  volatile uint32_t timeout = k_usb_fifo_timeout_iterations;
  while (!(usb0()->cfifoctr & k_usb_fifoctr_frdy) && timeout--) {
    __asm__ volatile("nop");
  }

  if (timeout == k_usb_fifo_timeout_expired) {
    rx_log_error(s_tag, "FIFO read timeout");
    return k_min_transfer_size;
  }

  /* Get received data length */
  uint32_t len = usb0()->cfifoctr & k_usb_fifoctr_dtln_mask;
  if (len > max_len) {
    rx_log_error(s_tag, "FIFO read overflow detected");
    len = max_len;
  }

  /* Read data from FIFO (16-bit access required by RX72N Manual Ch40 40.3.9) */
  /* CRITICAL FIX: CFIFO is 16-bit register, must read 16 bits at a time */
  for (uint32_t i = 0; i < len; i += 2) {
    const uint16_t word = usb0()->cfifo;          /* Read 16-bit word */
    data[i]             = (uint8_t)(word & 0xFF); /* Low byte */
    if ((i + 1) < len) {
      data[i + 1] = (uint8_t)((word >> 8) & 0xFF); /* High byte */
    }
  }

  /* Clear buffer */
  usb0()->cfifoctr |= k_usb_fifoctr_bclr;

  /* Rule 5: Post-condition validation */
  if (len > max_len) {
    rx_log_error(s_tag, "FIFO read length validation failed");
    return k_min_transfer_size;
  }

  return len;
}

/**
 * @brief Write data to USB FIFO
 *
 * @param pipe Pipe number (0 = DCP, 1-9 = data pipes)
 * @param data Input buffer
 * @param len Number of bytes to write
 * @return Number of bytes written
 */
uint32_t rx_usb_hw_fifo_write(uint8_t pipe, const uint8_t* data, uint32_t len)
{
  /* Rule 5: Pre-condition validation */
  if (data == nullptr || len == k_min_transfer_size) {
    return k_min_transfer_size;
  }

  /* Validate pipe number */
  if (pipe > k_usb_pipe_max) {
    rx_log_error(s_tag, "Invalid pipe number");
    return k_min_transfer_size;
  }

  /* Select pipe for CFIFO access with write direction */
  usb0()->cfifosel = (pipe & k_usb_fifosel_curpipe_mask) | k_usb_fifosel_isel;

  /* Wait for FIFO ready (hardware polling) */
  /* NOTE: Busy-wait appropriate - microsecond-scale hardware readiness check */
  volatile uint32_t timeout = k_usb_fifo_timeout_iterations;
  while (!(usb0()->cfifoctr & k_usb_fifoctr_frdy) && timeout--) {
    __asm__ volatile("nop");
  }

  if (timeout == k_usb_fifo_timeout_expired) {
    rx_log_error(s_tag, "FIFO write timeout");
    return k_min_transfer_size;
  }

  /* Clear FIFO buffer before write (RX72N Manual Ch40 40.3.9 requirement) */
  /* HIGH PRIORITY FIX: Prevents stale data from previous transfer */
  usb0()->cfifoctr |= k_usb_fifoctr_bclr;

  /* Wait for BCLR to complete (hardware clears bit when done) */
  timeout = k_usb_fifo_timeout_iterations;
  while ((usb0()->cfifoctr & k_usb_fifoctr_bclr) && timeout--) {
    __asm__ volatile("nop");
  }

  if (timeout == k_usb_fifo_timeout_expired) {
    rx_log_error(s_tag, "FIFO clear timeout");
    return k_min_transfer_size;
  }

  /* Write data to FIFO (16-bit access required by RX72N Manual Ch40 40.3.9) */
  /* CRITICAL FIX: CFIFO is 16-bit register, must write 16 bits at a time */
  for (uint32_t i = 0; i < len; i += 2) {
    uint16_t word = data[i]; /* Low byte */
    if ((i + 1) < len) {
      word |= ((uint16_t)data[i + 1] << 8); /* High byte */
    }
    usb0()->cfifo = word; /* Write 16-bit word */
  }

  /* Set buffer valid to signal data ready for transmission */
  usb0()->cfifoctr |= k_usb_fifoctr_bval;

  return len;
}

/**
 * @brief Get current USB bus state from hardware
 */
rx_usb_state_t rx_usb_hw_get_bus_state(void)
{
  const uint16_t intsts0 = usb0()->intsts0;
  const uint16_t dvsq    = (intsts0 & k_usb_intsts0_dvsq_mask);
  switch (dvsq) {
    case k_usb_intsts0_dvsq_powered:
      return k_usb_state_powered;
    case k_usb_intsts0_dvsq_default:
      return k_usb_state_default;
    case k_usb_intsts0_dvsq_address:
      return k_usb_state_addressed;
    case k_usb_intsts0_dvsq_configured:
      return k_usb_state_configured;
    case k_usb_intsts0_dvsq_suspend:
      return k_usb_state_suspended;
    default:
      return k_usb_state_detached;
  }
}

/**
 * @brief Set USB address (called during enumeration)
 */
void rx_usb_hw_set_address(const uint8_t address)
{
  usb0()->usbaddr = address & k_usb_address_mask_hw;
  rx_log_debug(s_tag, "USB address set");
}

/**
 * @brief Configure a pipe for bulk/interrupt transfer
 */
rx_err_t rx_usb_hw_configure_pipe(const uint8_t  pipe,
                                  const uint8_t  endpoint,
                                  const bool     is_in,
                                  const uint16_t type,
                                  const uint16_t max_packet)
{
  /* Rule 5: Pre-condition validation */
  if (pipe == k_usb_pipe_min || pipe > k_usb_pipe_max) {
    return k_rx_err_invalid_arg;
  }

  /* Validate endpoint number (0-15) */
  if (endpoint > k_usb_endpoint_max) {
    rx_log_error(s_tag, "Invalid endpoint number");
    return k_rx_err_invalid_arg;
  }

  /* Validate max packet size */
  if (max_packet > k_usb_max_packet_size_max) {
    rx_log_error(s_tag, "Invalid max packet size");
    return k_rx_err_invalid_arg;
  }

  /* Select pipe for configuration */
  usb0()->pipesel = pipe;

  /* Configure pipe */
  uint16_t cfg = (endpoint & k_usb_pipecfg_epnum_mask) | type;

  if (is_in) {
    cfg |= k_usb_pipecfg_dir; /* DIR=1 for IN (device to host) */
  }

  usb0()->pipecfg  = cfg;
  usb0()->pipemaxp = max_packet;

  /* Map pipe control registers to avoid undefined pointer arithmetic on struct members.
   * Array contains pointers to contiguous pipe control registers (pipe1ctr through pipe9ctr). */
  volatile uint16_t* pipe_ctr_map[] = {
    &usb0()->pipe1ctr,
    &usb0()->pipe2ctr,
    &usb0()->pipe3ctr,
    &usb0()->pipe4ctr,
    &usb0()->pipe5ctr,
    &usb0()->pipe6ctr,
    &usb0()->pipe7ctr,
    &usb0()->pipe8ctr,
    &usb0()->pipe9ctr,
  };

  /* Clear pipe (pipe numbers start at 1, so index is pipe - 1) */
  volatile uint16_t* pipe_ctr = pipe_ctr_map[pipe - 1];
  *pipe_ctr |= k_usb_pipectr_aclrm;
  *pipe_ctr &= (uint16_t)~k_usb_pipectr_aclrm;

  /* Enable pipe */
  *pipe_ctr = (uint16_t)((*pipe_ctr & (uint16_t)~k_usb_pipectr_pid_mask) | k_usb_pipectr_pid_buf);

  return k_rx_ok;
}
